# Editor
brew "nano"

# Terminal
brew "zellij"
brew "sheldon"
brew "zoxide"
brew "eza"
brew "bat"
brew "ripgrep"
brew "fd"
brew "starship"
brew "gitui"
brew "git-delta"
brew "ghq"
brew "peco"

# macOS only
if OS.mac?
  cask "ghostty"
  brew "skhd"

  # Fonts
  cask "font-hackgen"
  cask "font-hackgen-nerd"
end
