# Editor
brew "neovim"

# AI
brew "claude-cmd"
brew "uv"  # Python package manager (required for Serena MCP)

# Terminal
brew "tmux"
brew "zellij"
brew "sheldon"
brew "zoxide"
brew "eza"
brew "bat"
brew "ripgrep"
brew "fd"
brew "starship"
brew "gitui"
brew "git-delta"
brew "ghq"
brew "fzf"

# macOS only
if OS.mac?
  cask "ghostty"
  brew "skhd"
  brew "yabai"

  # Fonts
  cask "font-hackgen"
  cask "font-hackgen-nerd"
end
